HarryZeng/stm32f031_W8SET_CI_And_MARK/MDK-ARM/main.c
	TIM_ARRPreloadConfig(TIM1,ENABLE);
	
  /* TIM1 ?????*/
	//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);							//选择TIM1的timer为触发源  
	TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC1Ref);							//选择TIM1的timer为触发源  
	//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC2Ref);							//选择TIM1的timer为触发源  
	//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC3Ref);							//选择TIM1的timer为触发源  
	//TIM_SelectSlaveMode(TIM1, TIM_SlaveMode_Gated);//触发模式只启动，门控制启停都可以控制
	TIM_ClearITPendingBit(TIM1, TIM_IT_Update);     //清除update事件中断标志
	//TIM_SelectMasterSlaveMode(TIM1, TIM_MasterSlaveMode_Enable);//主从模式MSM  
	TIM_CtrlPWMOutputs(TIM1, ENABLE);
	//TIM_SelectOnePulseMode(TIM1,TIM_OPMode_Single);
	
  TIM_Cmd(TIM1, ENABLE);
	
  /* TIM1 ????? */
  

}  

///*重设TIM1进入OnePule模式，用于控制脉冲个数*/

//void ChangeTIM1ToOnePulse(int Counter)
//{
//	TIM_TimeBaseInitTypeDef timer_init_structure;
//	TIM_Cmd(TIM1, DISABLE);
//	
//	timer_init_structure.TIM_RepetitionCounter = Counter;
//  TIM_TimeBaseInit(TIM1, &timer_init_structure);
//	
//	
//	TIM_SelectOnePulseMode(TIM1,TIM_OPMode_Single);
//	TIM_Cmd(TIM1, DISABLE);
//}

    
/****************************??????****************************/  
uint8_t PWM_Start_Flag = 0;
uint8_t PWM_Start_Counter = 0;
void TIM2_IRQHandler()  
{  
    if(TIM_GetITStatus(TIM2, TIM_FLAG_Update))            //判断发生update事件中断  
    {  
				//_Gpio_7_set;
			if(PWM_Step==0)
			{
				PWMX_ON;
				PWMY_OFF;
				PWMZ_OFF;
				//TIM_SetCompare1(TIM1, PWMx_HIGH);
				PWM_Start_Flag = 1;
				PWM_Step++;
			}
        TIM_ClearFlag(TIM2, TIM_FLAG_Update);     //清除update事件中断标志
    }  
}  
int16_t captureX=0,captureY=0,captureZ=0;
void TIM1_BRK_UP_TRG_COM_IRQHandler()  
{  
    if(TIM_GetITStatus(TIM1, TIM_FLAG_Update)==SET)            //判断发生update事件中断  
    {
      TIM_ClearFlag(TIM1, TIM_FLAG_Update);     //清除update事件中断标志
    }
		if(TIM_GetITStatus(TIM1, TIM_IT_CC1) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_IT_CC1 ); //清除update事件中断标志
			captureX = TIM_GetCapture1(TIM1);
			if(captureX==PWMx_HIGH)
			{
				ADC_StartOfConversion(ADC1); 
				//TIM_SetCompare1(TIM1, PWMx_HIGH);				
			}				
		}
		if(TIM_GetITStatus(TIM1, TIM_IT_CC2) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_FLAG_CC2);     //清除update事件中断标志
			captureY = TIM_GetCapture2(TIM1);
			if(captureY==PWMy_HIGH)
			{
				ADC_StartOfConversion(ADC1); 
				//TIM_SetCompare2(TIM1, PWMy_HIGH);	
			}
		}
		if(TIM_GetITStatus(TIM1, TIM_IT_CC3) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_FLAG_CC3);     //清除update事件中断标志
			captureZ = TIM_GetCapture3(TIM1);
			if(captureZ==PWMz_HIGH)
			{
				ADC_StartOfConversion(ADC1); 
				//TIM_SetCompare3(TIM1, PWMz_HIGH);	
			}
		}
} 



extern uint32_t   ShortCircuitLastTime;
void TIM3_IRQHandler()
{
	  if(TIM_GetITStatus(TIM3, TIM_IT_Update))            //判断发生update事件中断  
    { 
			scan_tick++;
			ShortCircuitLastTime++;
			if(scan_tick>=15)  /*15ms*/
			{
				scan_tick = 0;
				scan_key();
			}
			TIM_ClearITPendingBit(TIM3, TIM_IT_Update);     //清除update事件中断标志
		}
}


int16_t  RunTime = 0; 

extern uint8_t SelfGetADCWell;
extern uint8_t FB_Flag;
uint8_t ADCIndex=0;
uint8_t DMAIndex=0;
int16_t selfADCValue[12];
void DMA1_Channel1_IRQHandler()  
{  
    if(DMA_GetITStatus(DMA_IT_TC))                      //判断DMA传输完成中断  
    {   
			if(PWM_Step==3)
					PWM_Step  = 0;
			selfADCValue[ADCIndex++] = 4095 - adc_dma_tab[0];
			//_Gpio_7_set;
			if(ADCIndex>=12)   //X,Y,Z三组，四个，==12个    /*需要采集完4组才计算？？？？，要480us*/
			{
				ADCIndex = 0;
				if(EnterSelfFlag&&(DMAIndex==0))//自学习模式
				{
						DMAIndex=1;
						SelfGetADCWell=1;
				}
				else													//正常工作模式
				{
					sample_finish = 1;
					//RunTime = TIM_GetCounter(TIM14);
				}
			}

			if(PWM_Start_Flag==1)
			{
				if(PWM_Step==1)
				{
					PWMX_OFF;
					PWMY_ON;
					PWMZ_OFF;
					PWM_Step++;
				}
				else if(PWM_Step==2)
				{
					PWM_Step++;
					PWMX_OFF;
					PWMY_OFF;
					PWMZ_ON;
					//
					PWM_Start_Flag = 0;
				}
			}
    }  
    DMA_ClearITPendingBit(DMA_IT_TC);                   //清楚DMA中断标志位  
}  

void TIM14_IRQHandler()
{
	  if(TIM_GetITStatus(TIM14, TIM_IT_Update))            //判断发生update事件中断  
    { 
//			if(PWM_Start_Flag==1)
//			{
//				PWM_Start_Counter++;
//				if(PWM_Start_Counter%9==0)
//				{
//					PWMX_OFF;
//					PWMY_ON;
//					PWMZ_OFF;
//				}
//				if(PWM_Start_Counter%17==0)
//				{
//					PWMX_OFF;
//					PWMY_OFF;
//					PWMZ_ON;
//					PWM_Start_Counter  = 0;
//					PWM_Start_Flag = 0;
//				}
//			}
			TIM_ClearITPendingBit(TIM14, TIM_IT_Update);     //清除update事件中断标志
		}
}
/***********************/
void TIM16_Config(void)
{
    TIM_TimeBaseInitTypeDef timer_init_structure;  
		NVIC_InitTypeDef nvic_init_structure;  	
	
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM14, ENABLE);
		/*TIM14*/
		TIM_DeInit(TIM14);                                               //复位TIM14

		nvic_init_structure.NVIC_IRQChannel = TIM14_IRQn;                //使能TIM14中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM14中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 1;                //优先级为4
    NVIC_Init(&nvic_init_structure); 	

    TIM_TimeBaseStructInit(&timer_init_structure);                  //初始化TIM结构体  
  
    timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //系统时钟,不分频,24M  
    timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //向上计数模式  
    timer_init_structure.TIM_Period = 1000;                          //每300 uS触发一次中断,??ADC  
    timer_init_structure.TIM_Prescaler = 47;                      //计数时钟分频,f=1M,systick=1 uS  
    timer_init_structure.TIM_RepetitionCounter = 0x00;              //发生0+1的update事件产生中断 
		
    TIM_TimeBaseInit(TIM14, &timer_init_structure);  
		TIM_ITConfig(TIM14, TIM_IT_Update, ENABLE);                      //使能TIM14中断
    TIM_Cmd(TIM14, ENABLE);                                          //使能TIM14
}


void GPIO_INIT(void)
{
	
	    GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOF, ENABLE);  
  
