HarryZeng/stm32f031_W8SET_CI_And_MARK/MDK-ARM/main.c
    GPIO_StructInit(&gpio_init_structure);  
                                                        //PA-0~3??ADC  
    gpio_init_structure.GPIO_Pin = OUT_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(OUT_GPIO_Port, &gpio_init_structure);  
	
		gpio_init_structure.GPIO_Pin = FB_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??
    GPIO_Init(FB_GPIO_Port, &gpio_init_structure);  
	
		gpio_init_structure.GPIO_Pin = GOODBAD_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??
    GPIO_Init(GOODBAD_GPIO_Port, &gpio_init_structure);  
	
		gpio_init_structure.GPIO_Pin = SET_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??
    GPIO_Init(SET_GPIO_Port, &gpio_init_structure);  

}

void GPIO_DEINIT_ALL(void)
{
	
	   GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOF, ENABLE);  
  
    GPIO_StructInit(&gpio_init_structure);  
                                                        //PA-0~3??ADC  
    gpio_init_structure.GPIO_Pin = GPIO_Pin_7;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??  
    GPIO_Init(GPIOA, &gpio_init_structure); 
	
//    gpio_init_structure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8;  
//    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
//    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
//    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
//    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??  
//    GPIO_Init(GPIOB, &gpio_init_structure);  

//    gpio_init_structure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;  
//    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
//    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
//    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
//    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??  
//    GPIO_Init(GPIOF, &gpio_init_structure); 
}


void RCC_Configuration(void)
{
	RCC_PLLConfig(RCC_PLLSource_HSI,RCC_PLLMul_12);
	RCC_PLLCmd(ENABLE);
	RCC_ADCCLKConfig(RCC_ADCCLK_PCLK_Div4);
	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY)==RESET)
	{
		
	}
	
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
	
	while(RCC_GetSYSCLKSource()!=0x08)
	{
	}
}

void DelaymsSet(int16_t ms)
{
		while(1)
		{
			ms--;
			if(ms<=0)
				break;
		}
}

int main(void)
{
	RCC_Configuration();
	GPIO_INIT();
	user_adc_init();
	RCC_GetClocksFreq(&SysClock);
	TIM16_Config();
	DelaymsSet(5000); 
	
	DataProcess();
}


